{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "name": "lambda_1", "function_type": "lambda", "arguments": {}, "output_shape": [200, 66, 3], "trainable": true, "output_shape_type": "raw", "batch_input_shape": [null, 200, 66, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u0080\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>=\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "activation": "relu", "activity_regularizer": null, "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "name": "convolution2d_1", "nb_row": 5, "W_constraint": null, "b_regularizer": null, "bias": true, "subsample": [2, 2], "init": "glorot_uniform", "nb_filter": 24, "b_constraint": null, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "activation": "relu", "activity_regularizer": null, "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "name": "convolution2d_2", "nb_row": 5, "W_constraint": null, "b_regularizer": null, "bias": true, "subsample": [2, 2], "init": "glorot_uniform", "nb_filter": 36, "b_constraint": null, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "activation": "relu", "activity_regularizer": null, "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "name": "convolution2d_3", "nb_row": 5, "W_constraint": null, "b_regularizer": null, "bias": true, "subsample": [2, 2], "init": "glorot_uniform", "nb_filter": 48, "b_constraint": null, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "activation": "relu", "activity_regularizer": null, "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "name": "convolution2d_4", "nb_row": 3, "W_constraint": null, "b_regularizer": null, "bias": true, "subsample": [1, 1], "init": "glorot_uniform", "nb_filter": 64, "b_constraint": null, "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "activation": "relu", "activity_regularizer": null, "dim_ordering": "tf", "trainable": true, "W_regularizer": null, "name": "convolution2d_5", "nb_row": 3, "W_constraint": null, "b_regularizer": null, "bias": true, "subsample": [1, 1], "init": "glorot_uniform", "nb_filter": 64, "b_constraint": null, "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.4, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "b_regularizer": null, "activation": "relu", "W_regularizer": null, "name": "dense_1", "input_dim": 1152, "W_constraint": null, "bias": true, "output_dim": 100, "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "b_regularizer": null, "activation": "relu", "W_regularizer": null, "name": "dense_2", "input_dim": 100, "W_constraint": null, "bias": true, "output_dim": 50, "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "b_regularizer": null, "activation": "relu", "W_regularizer": null, "name": "dense_3", "input_dim": 50, "W_constraint": null, "bias": true, "output_dim": 10, "init": "glorot_uniform", "b_constraint": null}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "W_regularizer": null, "name": "dense_4", "input_dim": 10, "W_constraint": null, "bias": true, "output_dim": 1, "init": "glorot_uniform", "b_constraint": null}}]}