{"keras_version": "1.2.0", "config": [{"config": {"function_type": "lambda", "name": "lambda_1", "output_shape": [200, 66, 3], "trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 200, 66, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u0080\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>=\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"dim_ordering": "tf", "nb_row": 5, "init": "glorot_uniform", "bias": true, "nb_col": 5, "name": "convolution2d_1", "W_constraint": null, "b_regularizer": null, "activation": "relu", "activity_regularizer": null, "trainable": true, "border_mode": "valid", "subsample": [2, 2], "W_regularizer": null, "nb_filter": 24, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "nb_row": 5, "init": "glorot_uniform", "bias": true, "nb_col": 5, "name": "convolution2d_2", "W_constraint": null, "b_regularizer": null, "activation": "relu", "activity_regularizer": null, "trainable": true, "border_mode": "valid", "subsample": [2, 2], "W_regularizer": null, "nb_filter": 36, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "nb_row": 5, "init": "glorot_uniform", "bias": true, "nb_col": 5, "name": "convolution2d_3", "W_constraint": null, "b_regularizer": null, "activation": "relu", "activity_regularizer": null, "trainable": true, "border_mode": "valid", "subsample": [2, 2], "W_regularizer": null, "nb_filter": 48, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "nb_row": 3, "init": "glorot_uniform", "bias": true, "nb_col": 3, "name": "convolution2d_4", "W_constraint": null, "b_regularizer": null, "activation": "relu", "activity_regularizer": null, "trainable": true, "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null, "nb_filter": 64, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "nb_row": 3, "init": "glorot_uniform", "bias": true, "nb_col": 3, "name": "convolution2d_5", "W_constraint": null, "b_regularizer": null, "activation": "relu", "activity_regularizer": null, "trainable": true, "border_mode": "valid", "subsample": [1, 1], "W_regularizer": null, "nb_filter": 64, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "p": 0.4, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"input_dtype": "float32", "input_dim": 1152, "bias": true, "batch_input_shape": [null, 1152], "output_dim": 100, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "activation": "relu", "b_constraint": null, "trainable": true, "W_regularizer": null, "name": "dense_1", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"input_dtype": "float32", "input_dim": 100, "bias": true, "batch_input_shape": [null, 100], "output_dim": 50, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "activation": "relu", "b_constraint": null, "trainable": true, "W_regularizer": null, "name": "dense_2", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"input_dtype": "float32", "input_dim": 50, "bias": true, "batch_input_shape": [null, 50], "output_dim": 10, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "activation": "relu", "b_constraint": null, "trainable": true, "W_regularizer": null, "name": "dense_3", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"input_dtype": "float32", "input_dim": 10, "bias": true, "batch_input_shape": [null, 10], "output_dim": 1, "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "activation": "linear", "b_constraint": null, "trainable": true, "W_regularizer": null, "name": "dense_4", "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}