{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"trainable": true, "name": "lambda_1", "output_shape": [200, 66, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u0080\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>=\u0000\u0000\u0000\u00f3\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 200, 66, 3], "input_dtype": "float32", "output_shape_type": "raw", "function_type": "lambda", "arguments": {}}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "border_mode": "valid", "b_constraint": null, "b_regularizer": null, "trainable": true, "name": "convolution2d_1", "subsample": [2, 2], "nb_col": 5, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "nb_filter": 24, "dim_ordering": "tf", "activation": "relu", "nb_row": 5}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "border_mode": "valid", "b_constraint": null, "b_regularizer": null, "trainable": true, "name": "convolution2d_2", "subsample": [2, 2], "nb_col": 5, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "nb_filter": 36, "dim_ordering": "tf", "activation": "relu", "nb_row": 5}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "border_mode": "valid", "b_constraint": null, "b_regularizer": null, "trainable": true, "name": "convolution2d_3", "subsample": [2, 2], "nb_col": 5, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "nb_filter": 48, "dim_ordering": "tf", "activation": "relu", "nb_row": 5}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "border_mode": "valid", "b_constraint": null, "b_regularizer": null, "trainable": true, "name": "convolution2d_4", "subsample": [1, 1], "nb_col": 3, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "nb_filter": 64, "dim_ordering": "tf", "activation": "relu", "nb_row": 3}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "border_mode": "valid", "b_constraint": null, "b_regularizer": null, "trainable": true, "name": "convolution2d_5", "subsample": [1, 1], "nb_col": 3, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "nb_filter": 64, "dim_ordering": "tf", "activation": "relu", "nb_row": 3}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.4}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"input_dim": 1152, "W_constraint": null, "bias": true, "output_dim": 100, "input_dtype": "float32", "batch_input_shape": [null, 1152], "b_constraint": null, "trainable": true, "name": "dense_1", "activation": "relu", "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Dense", "config": {"input_dim": 100, "W_constraint": null, "bias": true, "output_dim": 50, "input_dtype": "float32", "batch_input_shape": [null, 100], "b_constraint": null, "trainable": true, "name": "dense_2", "activation": "relu", "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Dense", "config": {"input_dim": 50, "W_constraint": null, "bias": true, "output_dim": 10, "input_dtype": "float32", "batch_input_shape": [null, 50], "b_constraint": null, "trainable": true, "name": "dense_3", "activation": "relu", "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Dense", "config": {"input_dim": 10, "W_constraint": null, "bias": true, "output_dim": 1, "input_dtype": "float32", "batch_input_shape": [null, 10], "b_constraint": null, "trainable": true, "name": "dense_4", "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null}}], "keras_version": "1.2.0"}